In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('./Online_Retail.xlsx', sheet_name=0)

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Transaction Type Categories
0,536370,10002,INFLATABLE POLITICAL GLOBE,48,2010-12-01 08:45:00,0.85,12583.0,France,Sold
1,536382,10002,INFLATABLE POLITICAL GLOBE,12,2010-12-01 09:45:00,0.85,16098.0,United Kingdom,Sold
2,536756,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-02 14:23:00,0.85,NaN,United Kingdom,Sold
3,536863,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-03 11:19:00,0.85,17967.0,United Kingdom,Sold
4,536865,10002,INFLATABLE POLITICAL GLOBE,5,2010-12-03 11:28:00,1.66,NaN,United Kingdom,Sold

In [4]:
df.shape

(541909, 9)

In [5]:
df.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541909.000000,406829.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611114,15287.690570
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.759853,1713.600303

In [6]:
df.dtypes

InvoiceNo                              object
StockCode                              object
Description                            object
Quantity                                int64
InvoiceDate                    datetime64[ns]
UnitPrice                             float64
CustomerID                            float64
Country                                object
Transaction Type Categories            object
dtype: object

In [7]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Transaction Type Categories'],
      dtype='object')

In [8]:
df.columns = df.columns.str.lower()

df.columns

Index(['invoiceno', 'stockcode', 'description', 'quantity', 'invoicedate',
       'unitprice', 'customerid', 'country', 'transaction type categories'],
      dtype='object')

In [9]:
df.columns = df.columns.str.replace('invoiceno', 'invoice_no')
df.columns = df.columns.str.replace('stockcode', 'stock_code')
df.columns = df.columns.str.replace('invoicedate', 'invoice_date')
df.columns = df.columns.str.replace('unitprice', 'unit_price')
df.columns = df.columns.str.replace('customerid', 'customer_id')
df.columns = df.columns.str.replace('transaction type categories','transaction_type_categories')

df.columns

Index(['invoice_no', 'stock_code', 'description', 'quantity', 'invoice_date',
       'unit_price', 'customer_id', 'country', 'transaction_type_categories'],
      dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   invoice_no                   541909 non-null  object
 1   stock_code                   541909 non-null  object
 2   description                  540455 non-null  object
 3   quantity                     541909 non-null  int64
 4   invoice_date                 541909 non-null  datetime64[ns]
 5   unit_price                   541909 non-null  float64
 6   customer_id                  406829 non-null  float64
 7   country                      541909 non-null  object
 8   transaction_type_categories  541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 37.2+ MB

In [11]:
df_blank = df[df['customer_id'].isna()]
print(df_blank)

       invoice_no stock_code                  description  quantity  \
2          536756      10002  INFLATABLE POLITICAL GLOBE          1
4          536865      10002  INFLATABLE POLITICAL GLOBE          5
5          536876      10002  INFLATABLE POLITICAL GLOBE          2
8          537240      10002  INFLATABLE POLITICAL GLOBE          1
9          537638      10002  INFLATABLE POLITICAL GLOBE          5
...           ...        ...                          ...       ...
541904    C572347          S                      SAMPLES        -1
541905     572849          S                      SAMPLES         1
541906    C577330          S                      SAMPLES        -1
541907    C577330          S                      SAMPLES        -1
541908    C577330          S                      SAMPLES        -1

              invoice_date  unit_price  customer_id         country  \
2      2010-12-02 14:23:00        0.85          NaN  United Kingdom
4      2010-12-03 11:28:00        1.66          NaN  United Kingdom
5      2010-12-03 11:36:00        1.66          NaN  United Kingdom
8      2010-12-06 10:08:00        1.66          NaN  United Kingdom
9      2010-12-07 15:28:00        1.66          NaN  United Kingdom
...                    ...         ...          ...             ...
541904 2011-10-24 11:03:00       33.05          NaN  United Kingdom
541905 2011-10-26 12:20:00       33.05          NaN  United Kingdom
541906 2011-11-18 14:16:00        2.89          NaN  United Kingdom
541907 2011-11-18 14:16:00       75.00          NaN  United Kingdom
541908 2011-11-18 14:16:00        5.99          NaN  United Kingdom

       transaction_type_categories
2                             Sold
4                             Sold
5                             Sold
8                             Sold
9                             Sold
...                            ...
541904                     SAMPLES
541905                        Sold
541906                     SAMPLES
541907                     SAMPLES
541908                     SAMPLES

[135080 rows x 9 columns]

In [12]:
# Optimize memory usage by converting `quantity` to int32
df['quantity'] = df['quantity'].astype('int32')  # int32 can store these values

# Convert `invoice_date` to `datetime64[s]` (seconds precision)
df['invoice_date'] = df['invoice_date'].astype('datetime64[s]')

# Convert `unit_price` to `float32` for memory optimization
df['unit_price'] = df['unit_price'].astype('float32')

# Convert `customer_id` to float32 (since the max value 18287 fits within int16 range)
df['customer_id'] = df['customer_id'].astype('float32')


df.dtypes

invoice_no                            object
stock_code                            object
description                           object
quantity                               int32
invoice_date                   datetime64[s]
unit_price                           float32
customer_id                          float32
country                               object
transaction_type_categories           object
dtype: object

In [13]:
unique_values = df['country'].unique()

print(unique_values)

['France' 'United Kingdom' 'EIRE' 'Germany' 'Spain' 'Switzerland' 'Japan'
 'Portugal' 'Canada' 'Israel' 'Norway' 'Unspecified' 'Greece' 'Italy'
 'Sweden' 'Australia' 'Netherlands' 'Denmark' 'Belgium' 'Iceland' 'Poland'
 'Hong Kong' 'Cyprus' 'Austria' 'USA' 'Finland' 'RSA' 'Lithuania' 'Brazil'
 'Singapore' 'Channel Islands' 'Saudi Arabia' 'United Arab Emirates'
 'Czech Republic' 'Malta' 'European Community' 'Lebanon' 'Bahrain']

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   invoice_no                   541909 non-null  object
 1   stock_code                   541909 non-null  object
 2   description                  540455 non-null  object
 3   quantity                     541909 non-null  int32
 4   invoice_date                 541909 non-null  datetime64[s]
 5   unit_price                   541909 non-null  float32
 6   customer_id                  406829 non-null  float32
 7   country                      541909 non-null  object
 8   transaction_type_categories  541909 non-null  object
dtypes: datetime64[s](1), float32(2), int32(1), object(5)
memory usage: 31.0+ MB

In [15]:
df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
541904    False
541905    False
541906    False
541907    False
541908    False
Length: 541909, dtype: bool

In [16]:
df.duplicated().sum()

np.int64(5268)

In [17]:
duplicated_rows = df[df.duplicated()]

print(duplicated_rows)

       invoice_no stock_code                   description  quantity  \
106        548309      10120                  DOGGY RUBBER         1
196        558860      10125       MINI FUNKY DESIGN TAPES         1
312        558049      10133  COLOURING PENCILS BROWN TUBE         1
394        564049      10133  COLOURING PENCILS BROWN TUBE        10
544        562258      10135  COLOURING PENCILS BROWN TUBE         1
...           ...        ...                           ...       ...
540481     572344          M                        Manual        48
540482     572344          M                        Manual        48
540483     572344          M                        Manual        48
540484     572344          M                        Manual        48
541863    C544580          S                       SAMPLES        -1

              invoice_date  unit_price  customer_id         country  \
106    2011-03-30 12:02:00        0.21      16657.0  United Kingdom
196    2011-07-04 12:18:00        0.85      17975.0  United Kingdom
312    2011-06-24 14:16:00        0.42      15850.0  United Kingdom
394    2011-08-22 13:30:00        0.42      17585.0  United Kingdom
544    2011-08-03 15:28:00        1.25      16348.0  United Kingdom
...                    ...         ...          ...             ...
540481 2011-10-24 10:43:00        1.50      14607.0  United Kingdom
540482 2011-10-24 10:43:00        1.50      14607.0  United Kingdom
540483 2011-10-24 10:43:00        1.50      14607.0  United Kingdom
540484 2011-10-24 10:43:00        1.50      14607.0  United Kingdom
541863 2011-02-21 14:25:00        9.74          NaN  United Kingdom

       transaction_type_categories
106                           Sold
196                           Sold
312                           Sold
394                           Sold
544                           Sold
...                            ...
540481                        Sold
540482                        Sold
540483                        Sold
540484                        Sold
541863                     SAMPLES

[5268 rows x 9 columns]

In [18]:
df.isnull().sum()

invoice_no                          0
stock_code                          0
description                      1454
quantity                            0
invoice_date                        0
unit_price                          0
customer_id                    135080
country                             0
transaction_type_categories         0
dtype: int64

In [19]:
df.drop_duplicates(inplace=True)

In [20]:
df.duplicated().sum()

np.int64(0)

In [21]:
df.shape

(536641, 9)

In [22]:
df.isnull().sum()

invoice_no                          0
stock_code                          0
description                      1454
quantity                            0
invoice_date                        0
unit_price                          0
customer_id                    135037
country                             0
transaction_type_categories         0
dtype: int64

In [23]:
df1 = df.copy()

df1.head()

,invoice_no,stock_code,description,quantity,invoice_date,unit_price,customer_id,country,transaction_type_categories
0,536370,10002,INFLATABLE POLITICAL GLOBE,48,2010-12-01 08:45:00,0.85,12583.0,France,Sold
1,536382,10002,INFLATABLE POLITICAL GLOBE,12,2010-12-01 09:45:00,0.85,16098.0,United Kingdom,Sold
2,536756,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-02 14:23:00,0.85,NaN,United Kingdom,Sold
3,536863,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-03 11:19:00,0.85,17967.0,United Kingdom,Sold
4,536865,10002,INFLATABLE POLITICAL GLOBE,5,2010-12-03 11:28:00,1.66,NaN,United Kingdom,Sold

In [24]:
df1.dtypes

invoice_no                            object
stock_code                            object
description                           object
quantity                               int32
invoice_date                   datetime64[s]
unit_price                           float32
customer_id                          float32
country                               object
transaction_type_categories           object
dtype: object

In [25]:
# df1['revenue'] = df1['unit_price'] * df1['quantity']

#specifying data type whlie creating column 
df1['revenue'] = (df1['unit_price'] * df1['quantity']).astype('float32')


df1.head()

,invoice_no,stock_code,description,quantity,invoice_date,unit_price,customer_id,country,transaction_type_categories,revenue
0,536370,10002,INFLATABLE POLITICAL GLOBE,48,2010-12-01 08:45:00,0.85,12583.0,France,Sold,40.800003
1,536382,10002,INFLATABLE POLITICAL GLOBE,12,2010-12-01 09:45:00,0.85,16098.0,United Kingdom,Sold,10.200001
2,536756,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-02 14:23:00,0.85,NaN,United Kingdom,Sold,0.850000
3,536863,10002,INFLATABLE POLITICAL GLOBE,1,2010-12-03 11:19:00,0.85,17967.0,United Kingdom,Sold,0.850000
4,536865,10002,INFLATABLE POLITICAL GLOBE,5,2010-12-03 11:28:00,1.66,NaN,United Kingdom,Sold,8.300000

In [26]:
df1.dtypes

invoice_no                            object
stock_code                            object
description                           object
quantity                               int32
invoice_date                   datetime64[s]
unit_price                           float32
customer_id                          float32
country                               object
transaction_type_categories           object
revenue                              float32
dtype: object

In [27]:
df1.tail()

,invoice_no,stock_code,description,quantity,invoice_date,unit_price,customer_id,country,transaction_type_categories,revenue
541904,C572347,S,SAMPLES,-1,2011-10-24 11:03:00,33.049999,NaN,United Kingdom,SAMPLES,-33.049999
541905,572849,S,SAMPLES,1,2011-10-26 12:20:00,33.049999,NaN,United Kingdom,Sold,33.049999
541906,C577330,S,SAMPLES,-1,2011-11-18 14:16:00,2.890000,NaN,United Kingdom,SAMPLES,-2.890000
541907,C577330,S,SAMPLES,-1,2011-11-18 14:16:00,75.000000,NaN,United Kingdom,SAMPLES,-75.000000
541908,C577330,S,SAMPLES,-1,2011-11-18 14:16:00,5.990000,NaN,United Kingdom,SAMPLES,-5.990000

In [28]:
# Filter the rows where invoice_no = 581483 and stock_code = 23843
filtered_data = df1[(df1['invoice_no'] == 581483) & (df['stock_code'] == 23843)]

# Now, select a revenue column 
selected_column = filtered_data['revenue']

print(selected_column)

442023    168469.59375
Name: revenue, dtype: float32

In [29]:
from dotenv import load_dotenv
import os

load_dotenv()  
host = os.getenv("HOST")
port = os.getenv("PORT")
user = os.getenv("USER")
password = os.getenv("PASSWORD")

In [30]:
# *** mysql tool kits ***

import pymysql
from sqlalchemy import create_engine

In [31]:
#mysql connections

try:
    engine_mysql = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/retail_sales_db")
    print("connected successfully to mysql")
except Exception as e:
    print("unable to connect")
    print(e)

connected successfully to mysql

In [32]:
df1.to_sql(name='retail_sales', con=engine_mysql,if_exists='append',index=False)

536641

In [33]:
df1.duplicated().sum()

np.int64(0)

In [34]:
df1.to_csv('retail_data.csv',index=False)

In [35]:
value = df1['transaction_type_categories'].unique()
print(value)

['Sold' 'Free Items' 'Inventory adjustments' 'Returns'
 'Inventory adjustments/Damaged' 'Sales Error/Order Error'
 'Inventory adjustments ' 'External Sales' ' samples' 'debt' 'Discount'
 'SAMPLES']